# Segmentar  e indexar Dataframes

Los índices son nombres de filas y columnas sobrecargados. Aprende cómo pueden combinarse con la segmentación para obtener un potente subconjunto del DataFrame.

## Establecer y eliminar índices

pandas te permite designar columnas como índice. Esto permite un código más limpio al tomar subconjuntos (además de proporcionar una búsqueda más eficaz en algunas circunstancias).

En este capítulo, explorarás temperatures, un DataFrame de temperaturas medias en ciudades de todo el mundo.

pandas se carga como pd.

**Instrucciones**

- Mira en temperatures.
- Establece el índice de temperatures en "city", asignándolo a temperatures_ind.
- Mira en temperatures_ind. ¿En qué se diferencia de temperatures?
- Restablece el índice de temperatures_ind, manteniendo su contenido.
- Restablece el índice de temperatures_ind, eliminando su contenido.

In [1]:
import pandas as pd

In [3]:
Temperatures = pd.read_csv("./Datasets/GlobalLandTemperaturesByCity.csv")

In [5]:
Temperatures.head()

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
0,1743-11-01,6.068,1.737,Århus,Denmark,57.05N,10.33E
1,1743-12-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
2,1744-01-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
3,1744-02-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
4,1744-03-01,NaN,NaN,Århus,Denmark,57.05N,10.33E

In [6]:
Temperatures.shape

(8599212, 7)

In [10]:
temperatures_df = Temperatures[['dt', 'City', 'Country', 'AverageTemperature']]

In [11]:
temperatures_df

                 dt    City      Country  AverageTemperature
0        1743-11-01   Århus      Denmark               6.068
1        1743-12-01   Århus      Denmark                 NaN
2        1744-01-01   Århus      Denmark                 NaN
3        1744-02-01   Århus      Denmark                 NaN
4        1744-03-01   Århus      Denmark                 NaN
...             ...     ...          ...                 ...
8599207  2013-05-01  Zwolle  Netherlands              11.464
8599208  2013-06-01  Zwolle  Netherlands              15.043
8599209  2013-07-01  Zwolle  Netherlands              18.775
8599210  2013-08-01  Zwolle  Netherlands              18.025
8599211  2013-09-01  Zwolle  Netherlands                 NaN

[8599212 rows x 4 columns]

In [ ]:
# Establece el indice de temperatures en